In [25]:
import pandas as pd

# 数据组合

## concat拼接数据

### 行拼接：按照列标签索引对齐

#### DataFrame和DataFrame 进行拼接：

In [26]:
# 加载数据集
df1 = pd.read_csv('./data/concat_1.csv')
df2 = pd.read_csv('./data/concat_2.csv')
df3 = pd.read_csv('./data/concat_3.csv')

In [27]:
df1

    A   B   C   D
0  a0  b0  c0  d0
1  a1  b1  c1  d1
2  a2  b2  c2  d2
3  a3  b3  c3  d3

In [28]:
df2

    A   B   C   D
0  a4  b4  c4  d4
1  a5  b5  c5  d5
2  a6  b6  c6  d6
3  a7  b7  c7  d7

In [29]:
df3

     A    B    C    D
0   a8   b8   c8   d8
1   a9   b9   c9   d9
2  a10  b10  c10  d10
3  a11  b11  c11  d11

In [30]:
# 将 df1、df2和 df3 按照列标签对齐，进行行拼接
row_concat = pd.concat([df1, df2, df3])
row_concat

     A    B    C    D
0   a0   b0   c0   d0
1   a1   b1   c1   d1
2   a2   b2   c2   d2
3   a3   b3   c3   d3
0   a4   b4   c4   d4
1   a5   b5   c5   d5
2   a6   b6   c6   d6
3   a7   b7   c7   d7
0   a8   b8   c8   d8
1   a9   b9   c9   d9
2  a10  b10  c10  d10
3  a11  b11  c11  d11

In [31]:
# 按照行位置获取数据
row_concat.iloc[3]

A    a3
B    b3
C    c3
D    d3
Name: 3, dtype: object

In [32]:
# 按照行标签获取数据
row_concat.loc[3]

     A    B    C    D
3   a3   b3   c3   d3
3   a7   b7   c7   d7
3  a11  b11  c11  d11

In [33]:
# ignore_index=True：表示 concat 拼接时忽略索引
pd.concat([df1, df2, df3], ignore_index=True)

      A    B    C    D
0    a0   b0   c0   d0
1    a1   b1   c1   d1
2    a2   b2   c2   d2
3    a3   b3   c3   d3
4    a4   b4   c4   d4
5    a5   b5   c5   d5
6    a6   b6   c6   d6
7    a7   b7   c7   d7
8    a8   b8   c8   d8
9    a9   b9   c9   d9
10  a10  b10  c10  d10
11  a11  b11  c11  d11

#### DataFrame 和 Series 进行拼接

In [34]:
# 创建一个 Series 数据
new_series = pd.Series(['n1', 'n2', 'n3', 'n4'])
print(new_series)

0    n1
1    n2
2    n3
3    n4
dtype: object

In [35]:
# 将 df1 和 new_series 按照列标签对齐，进行行拼接
pd.concat([df1, new_series])

     A    B    C    D    0
0   a0   b0   c0   d0  NaN
1   a1   b1   c1   d1  NaN
2   a2   b2   c2   d2  NaN
3   a3   b3   c3   d3  NaN
0  NaN  NaN  NaN  NaN   n1
1  NaN  NaN  NaN  NaN   n2
2  NaN  NaN  NaN  NaN   n3
3  NaN  NaN  NaN  NaN   n4

In [36]:
# 将 df1 和 new_series 按照列标签对齐，进行行拼接
pd.concat([df1, new_series])

     A    B    C    D    0
0   a0   b0   c0   d0  NaN
1   a1   b1   c1   d1  NaN
2   a2   b2   c2   d2  NaN
3   a3   b3   c3   d3  NaN
0  NaN  NaN  NaN  NaN   n1
1  NaN  NaN  NaN  NaN   n2
2  NaN  NaN  NaN  NaN   n3
3  NaN  NaN  NaN  NaN   n4

### 列拼接：按照行标签索引对齐

#### DataFrame和DataFrame 进行拼接

In [37]:
# 将 df1、df2和 df3 按照行标签对齐，进行列拼接
pd.concat([df1, df2, df3], axis=1)

    A   B   C   D   A   B   C   D    A    B    C    D
0  a0  b0  c0  d0  a4  b4  c4  d4   a8   b8   c8   d8
1  a1  b1  c1  d1  a5  b5  c5  d5   a9   b9   c9   d9
2  a2  b2  c2  d2  a6  b6  c6  d6  a10  b10  c10  d10
3  a3  b3  c3  d3  a7  b7  c7  d7  a11  b11  c11  d11

#### DataFrame 和 Series 进行拼接

In [38]:
# 创建一个 Series 数据
new_series = pd.Series(['n1', 'n2', 'n3', 'n4'])
print(new_series)

0    n1
1    n2
2    n3
3    n4
dtype: object

In [39]:
# df1 和 new_series 按照行标签对齐，进行列拼接
pd.concat([df1, new_series], axis=1)

    A   B   C   D   0
0  a0  b0  c0  d0  n1
1  a1  b1  c1  d1  n2
2  a2  b2  c2  d2  n3
3  a3  b3  c3  d3  n4

### join 参数的设置

In [40]:
df1

    A   B   C   D
0  a0  b0  c0  d0
1  a1  b1  c1  d1
2  a2  b2  c2  d2
3  a3  b3  c3  d3

In [41]:
df3

     A    B    C    D
0   a8   b8   c8   d8
1   a9   b9   c9   d9
2  a10  b10  c10  d10
3  a11  b11  c11  d11

In [42]:
# 修改 df1 和 df3 的 columns 列标签
df1.columns = ['A', 'B', 'C', 'D']

In [43]:
df3.columns = ['A', 'C', 'F', 'H']

In [44]:
df1

    A   B   C   D
0  a0  b0  c0  d0
1  a1  b1  c1  d1
2  a2  b2  c2  d2
3  a3  b3  c3  d3

In [45]:
df3

     A    C    F    H
0   a8   b8   c8   d8
1   a9   b9   c9   d9
2  a10  b10  c10  d10
3  a11  b11  c11  d11

In [46]:
# 将 df1 和 df3 按列标签对齐，进行行拼接，默认 outer
pd.concat([df1, df3])

     A    B    C    D    F    H
0   a0   b0   c0   d0  NaN  NaN
1   a1   b1   c1   d1  NaN  NaN
2   a2   b2   c2   d2  NaN  NaN
3   a3   b3   c3   d3  NaN  NaN
0   a8  NaN   b8  NaN   c8   d8
1   a9  NaN   b9  NaN   c9   d9
2  a10  NaN  b10  NaN  c10  d10
3  a11  NaN  b11  NaN  c11  d11

In [47]:
# 将 df1 和 df3 按列标签对齐，进行行拼接，设置 join='inner'
pd.concat([df1, df3], join='inner')

     A    C
0   a0   c0
1   a1   c1
2   a2   c2
3   a3   c3
0   a8   b8
1   a9   b9
2  a10  b10
3  a11  b11

## merge 关联数据

### 方法简介

merge 方法类似于 sql 中的 join 语句，用于两个数据集之间按照行标签列或列标签列进行连接，默认是inner，可以设置为：left、right、outer

merge函数的参数：
- left：左侧数据集
- right：右侧数据集
- how：关联方式，默认为 inner，可以设置为：left、right、outer
- on='列名'： 左侧和右则数据以哪一列进行关联操作，左右两侧列名相同时才指定 on 参数
- left_on='左侧列名' 和 right_on='右侧列名'：左右两侧关联时，列名不同时使用
- left_index=False：默认为 False，设置为 True，表示左侧的行标签列和右侧的数据进行关联
- right_index=False：默认为 False，设置为 True，表示左侧的数据和右侧的行标签列进行关联

### merge 示例

In [48]:
from sqlalchemy import create_engine

In [49]:
engine = create_engine('sqlite:///data/chinook.db')

In [50]:
# 加载数据
tracks = pd.read_sql_table('tracks',engine)

In [51]:
# 查看数据的前五个
tracks.head()

,TrackId,Name,AlbumId,MediaTypeId,GenreId,Composer,Milliseconds,Bytes,UnitPrice
0,1,For Those About To Rock (We Salute You),1,1,1,"Angus Young, Malcolm Young, Brian Johnson",343719,11170334,0.99
1,2,Balls to the Wall,2,2,1,None,342562,5510424,0.99
2,3,Fast As a Shark,3,2,1,"F. Baltes, S. Kaufman, U. Dirkscneider & W. Ho...",230619,3990994,0.99
3,4,Restless and Wild,3,2,1,"F. Baltes, R.A. Smith-Diesel, S. Kaufman, U. D...",252051,4331779,0.99
4,5,Princess of the Dawn,3,2,1,Deaffy & R.A. Smith-Diesel,375418,6290521,0.99

In [52]:
# 查看数据列的结构
tracks.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3503 entries, 0 to 3502
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   TrackId       3503 non-null   int64
 1   Name          3503 non-null   object
 2   AlbumId       3503 non-null   int64
 3   MediaTypeId   3503 non-null   int64
 4   GenreId       3503 non-null   int64
 5   Composer      2525 non-null   object
 6   Milliseconds  3503 non-null   int64
 7   Bytes         3503 non-null   int64
 8   UnitPrice     3503 non-null   float64
dtypes: float64(1), int64(6), object(2)
memory usage: 246.4+ KB

In [53]:
# 加载数据
genres = pd.read_sql_table('genres',engine)

In [54]:
# 查看数据的前五个
genres.head()

   GenreId                Name
0        1                Rock
1        2                Jazz
2        3               Metal
3        4  Alternative & Punk
4        5       Rock And Roll

In [55]:
# 查看数据列的结构
genres.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 25 entries, 0 to 24
Data columns (total 2 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   GenreId  25 non-null     int64
 1   Name     25 non-null     object
dtypes: int64(1), object(1)
memory usage: 528.0+ bytes

### merge示例：歌曲类型和歌曲数据进行merge

In [56]:
# 将genres和tracks数据按照Genreld进行merge操作，设置为left连接
tracks_sub = tracks[['TrackId','GenreId','Milliseconds']]
tracks_sub

      TrackId  GenreId  Milliseconds
0           1        1        343719
1           2        1        342562
2           3        1        230619
3           4        1        252051
4           5        1        375418
...       ...      ...           ...
3498     3499       24        286741
3499     3500       24        139200
3500     3501       24         66639
3501     3502       24        221331
3502     3503       10        206005

[3503 rows x 3 columns]

In [57]:
genres_tracks = pd.merge(genres,tracks_sub,on='GenreId',how='left')
genres_tracks

      GenreId       Name  TrackId  Milliseconds
0           1       Rock        1        343719
1           1       Rock        2        342562
2           1       Rock        3        230619
3           1       Rock        4        252051
4           1       Rock        5        375418
...       ...        ...      ...           ...
3498       24  Classical     3499        286741
3499       24  Classical     3500        139200
3500       24  Classical     3501         66639
3501       24  Classical     3502        221331
3502       25      Opera     3451        174813

[3503 rows x 4 columns]

In [58]:
# 计算不同类型音乐的平均时长
genres_time = genres_tracks.groupby('Name')['Milliseconds'].mean()
genres_time

Name
Alternative           2.640585e+05
Alternative & Punk    2.343538e+05
Blues                 2.703598e+05
Bossa Nova            2.195900e+05
Classical             2.938676e+05
Comedy                1.585264e+06
Drama                 2.575284e+06
Easy Listening        1.891642e+05
Electronica/Dance     3.029858e+05
Heavy Metal           2.974529e+05
Hip Hop/Rap           1.781763e+05
Jazz                  2.917554e+05
Latin                 2.328593e+05
Metal                 3.097494e+05
Opera                 1.748130e+05
Pop                   2.290341e+05
R&B/Soul              2.200669e+05
Reggae                2.471778e+05
Rock                  2.839100e+05
Rock And Roll         1.346435e+05
Sci Fi & Fantasy      2.911783e+06
Science Fiction       2.625549e+06
Soundtrack            2.443709e+05
TV Shows              2.145041e+06
World                 2.249238e+05
Name: Milliseconds, dtype: float64

In [59]:
# 将genre_time数据从ms转换为时间单位，保留到s，并且按照时间从高到低排序
pd.to_timedelta(genres_time,unit='ms').dt.floor('s').sort_values(ascending=False)

Name
Sci Fi & Fantasy     0 days 00:48:31
Science Fiction      0 days 00:43:45
Drama                0 days 00:42:55
TV Shows             0 days 00:35:45
Comedy               0 days 00:26:25
Metal                0 days 00:05:09
Electronica/Dance    0 days 00:05:02
Heavy Metal          0 days 00:04:57
Classical            0 days 00:04:53
Jazz                 0 days 00:04:51
Rock                 0 days 00:04:43
Blues                0 days 00:04:30
Alternative          0 days 00:04:24
Reggae               0 days 00:04:07
Soundtrack           0 days 00:04:04
Alternative & Punk   0 days 00:03:54
Latin                0 days 00:03:52
Pop                  0 days 00:03:49
World                0 days 00:03:44
R&B/Soul             0 days 00:03:40
Bossa Nova           0 days 00:03:39
Easy Listening       0 days 00:03:09
Hip Hop/Rap          0 days 00:02:58
Opera                0 days 00:02:54
Rock And Roll        0 days 00:02:14
Name: Milliseconds, dtype: timedelta64[ns]

# join关联数据

## 方法简介
- join 方法类是 merge 方法的一个特殊情况，被调用的数据集按照行标签索引|列标签索引和另一个数据集的行标签索引关联，默认是left，可以设置为：right，inner、outer

## join函数的参数
- other：右侧数据集
- how：关联方式，默认为 left，可以设置为：right、inner、outer
- on='左侧行标签或列标签'： 左侧数据集的行标签名称或列标签名称，on省略时，默认为左侧数据行标签

- lsuffix：关联后的数据中出现相同列名时，lsuffix指定左侧数据集出现相同列名的后缀

- rsuffix：关联后的数据中出现相同列名时，rsuffix指定右侧数据集出现相同列名的后缀

## join示例

In [60]:
# 加载数据集
stock_2016 = pd.read_csv('./data/stocks_2016.csv')
stock_2017 = pd.read_csv('./data/stocks_2017.csv')
stock_2018 = pd.read_csv('./data/stocks_2018.csv')

In [61]:
stock_2016

  Symbol  Shares  Low  High
0   AAPL      80   95   110
1   TSLA      50   80   130
2    WMT      40   55    70

In [62]:
stock_2017

  Symbol  Shares  Low  High
0   AAPL      50  120   140
1     GE     100   30    40
2    IBM      87   75    95
3    SLB      20   55    85
4    TXN     500   15    23
5   TSLA     100  100   300

In [63]:
stock_2018

  Symbol  Shares  Low  High
0   AAPL      40  135   170
1   AMZN       8  900  1125
2   TSLA      50  220   400

In [64]:
# stock_2016 和 stock_2017 按照行标签进行关联，设置为 outer 连接
stock_2016.join(stock_2017,lsuffix='2016',rsuffix='2017',how='outer')

,Symbol2016,Shares2016,Low2016,High2016,Symbol2017,Shares2017,Low2017,High2017
0,AAPL,80.0,95.0,110.0,AAPL,50,120,140
1,TSLA,50.0,80.0,130.0,GE,100,30,40
2,WMT,40.0,55.0,70.0,IBM,87,75,95
3,NaN,NaN,NaN,NaN,SLB,20,55,85
4,NaN,NaN,NaN,NaN,TXN,500,15,23
5,NaN,NaN,NaN,NaN,TSLA,100,100,300

In [65]:
# stock_2016 和 stock_2018 按照 Symbol 进行关联
stock_2016.join(stock_2018.set_index('Symbol'),lsuffix='2016',rsuffix='2018',on='Symbol')

  Symbol  Shares2016  Low2016  High2016  Shares2018  Low2018  High2018
0   AAPL          80       95       110        40.0    135.0     170.0
1   TSLA          50       80       130        50.0    220.0     400.0
2    WMT          40       55        70         NaN      NaN       NaN

In [66]:
stock_2018.set_index('Symbol')

        Shares  Low  High
Symbol
AAPL        40  135   170
AMZN         8  900  1125
TSLA        50  220   400

# 总结
- pd.concat([df1, df2, ..])：多个数据集(DataFrame或Series)之间按行标签索引或列标签索引拼接，默认是outer，可以设置为inner能够使用 merge 关联组合数据
- pd.merge(left, right, …)：merge 方法类似于 sql 中的 join 语句，用于两个数据集之间按照行标签索引|列标签索引链接，默认是inner，可以设置为：left、right、outer
- 能够使用 join 关联组合数据df.join(other, ...)：join 方法类是 merge 方法的一个特殊情况，被调用的数据集按照行标签索引|列标签索引和另一个数据集的行标签索引关联，默认是left，可以设置为：right，inner、outer